cool/tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/constant/regionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      regionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidRegionNames
(
    bottomAir
    topAir
);

solidRegionNames
(
    heater
    leftSolid
    rightSolid
);

pRef 100000;

// ************************************************************************* //
